#Szymon Odważny
## Nr albumu: 208949
>**"Titanic" competition, to konkurs na platformie kaggle.com. Należy utworzyć program, który przewidzi kto przeżyje katastrofę Titanica.** 

>"train.csv" to baza, w której znajdziemy informacje o członkach tragicznego rejsu. Trzeba sprawdzić którzy pasażerzy z bazy "test.csv" przeżyją katastrofę.

> Plan działania jest opisany przy każdej podanej komendzie.


> Zaimportowanie bibliotek "numpy", "pandas"

In [46]:
import numpy as np # to linear algebra
import pandas as pd # to data processing

> Zaimportowanie bazy danych "train.csv" oraz wyświetlanie początku bazy.

In [47]:
train_data = pd.read_csv("https://raw.githubusercontent.com/Szymon9708/missp/main/missp/competition%20titanic%20kaggle/train.csv")
train_data.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

> Zaimportowanie bazy danych "test.csv" oraz wyświetlanie początku bazy.

In [48]:
test_data = pd.read_csv("https://raw.githubusercontent.com/Szymon9708/missp/main/missp/competition%20titanic%20kaggle/test.csv")
test_data.head()

   PassengerId  Pclass  ... Cabin Embarked
0          892       3  ...   NaN        Q
1          893       3  ...   NaN        S
2          894       2  ...   NaN        Q
3          895       3  ...   NaN        S
4          896       3  ...   NaN        S

[5 rows x 11 columns]

> Wyświetlanie najważniejszych danych statystycznych z baz "train.csv" oraz "test.csv"

In [51]:
print("Dane train:")
train_data.describe()

Dane train:

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

In [52]:
print("Dane data:")
test_data.describe()

Dane data:

       PassengerId      Pclass         Age       SibSp       Parch        Fare
count   418.000000  418.000000  332.000000  418.000000  418.000000  417.000000
mean   1100.500000    2.265550   30.272590    0.447368    0.392344   35.627188
std     120.810458    0.841838   14.181209    0.896760    0.981429   55.907576
min     892.000000    1.000000    0.170000    0.000000    0.000000    0.000000
25%     996.250000    1.000000   21.000000    0.000000    0.000000    7.895800
50%    1100.500000    3.000000   27.000000    0.000000    0.000000   14.454200
75%    1204.750000    3.000000   39.000000    1.000000    0.000000   31.500000
max    1309.000000    3.000000   76.000000    8.000000    9.000000  512.329200

> Sprawdzanie typu danych w poszczególnych kolumnach i ilość wypełnionych wartości w bazach "train.csv" oraz "test.csv"

In [53]:
train_data.info()
print()
print(50*"=")
print()
test_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

==================================================

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

> Część wartości jest pustych i nazleży je usunąć albo uzupełnić. Poniżej została pokazana ilość brakujących danych.

In [54]:
print("Przed czyszczeniem danych:")
print("Brakujące wartości w danych train:")
missing_val_count_by_column = (train_data.isnull().sum())
print(missing_val_count_by_column[missing_val_count_by_column > 0])
print()
print("Brakujące wartości w danych test:")
missing_val_count_by_column = (test_data.isnull().sum())
print(missing_val_count_by_column[missing_val_count_by_column > 0])

Przed czyszczeniem danych:
Brakujące wartości w danych train:
Age         177
Cabin       687
Embarked      2
dtype: int64

Brakujące wartości w danych test:
Age       86
Fare       1
Cabin    327
dtype: int64

> W bazie train.csv oraz test.csv brakuje wieku podróżnych, dlatego zostaną one dodane jako mediana wieku podróżnych. 

> W bazie test.csv brakuje opłaty za bilet, dlatego zostanie ona dodana jako mediana cen biletów. 

> W bazie train.csv brakuje informujących o miejscu podjęcia na statek pasażerów,  dlatego zostaną one usunięte. 

> W bazie train.csv zmieniono typ danych w kolumnie "Embarked".

In [55]:
train_data.Age = train_data.Age.fillna(train_data.Age.median())

train_data.dropna(subset=['Embarked'],inplace = True)
one_hot_encoded_training_predictors = pd.get_dummies(train_data.Embarked)

test_data.Age = test_data.Age.fillna(test_data.Age.median())
test_data.Fare = test_data.Fare.fillna(test_data.Fare.median())

> Poniżej została pokazana wyłącznie ilość brakujących danych, które są niepotrzebne do dalszej pracy.

In [56]:
print("Po czyszczeniu danych:")
print("Brakujące wartości w danych train:")
missing_val_count_by_column = (train_data.isnull().sum())
print(missing_val_count_by_column[missing_val_count_by_column > 0])
print()
print("Brakujące wartości w danych test:")
missing_val_count_by_column = (test_data.isnull().sum())
print(missing_val_count_by_column[missing_val_count_by_column > 0])

Po czyszczeniu danych:
Brakujące wartości w danych train:
Cabin    687
dtype: int64

Brakujące wartości w danych test:
Cabin    327
dtype: int64

> Model jest uczony metodą random forest. W celu przewidzenia, który pasażer przeżyje należy skorzystać z danych: 
- płeć, 
- wiek,
- klasa biletu,  
- ilość rodzeństwa na statku, 
- ilość opiekunów na statku, 
- wysokość opłaty za bilet 
- port, z którego podjęto pasażera. 

> Ilość drzew oraz maksymalna liczba rozgałęzień to kolejno 130 oraz 7. To pozwala na osignięcie dopasowania w granicy 0.79186.

In [57]:
from sklearn.ensemble import RandomForestClassifier

y = train_data["Survived"]

features = ["Pclass", "Sex", "Age", "SibSp", "Parch", "Fare", "Embarked"]
X = pd.get_dummies(train_data[features])
X_test = pd.get_dummies(test_data[features])

model = RandomForestClassifier(n_estimators=130, max_depth=7, random_state=1)
model.fit(X, y)
predictions = model.predict(X_test)

output = pd.DataFrame({'PassengerId': test_data.PassengerId, 'Survived': predictions})
output.to_csv('my_submission.csv', index=False)
print("Your submission was successfully saved!")

Your submission was successfully saved!